// 总劳动人力数
let dataTotal = {
    total: 100,
    job: 40,
    company: 50,
    work: 60
}

// 人员区域分布
let dataArea = [
    [59, '水南街道'],
    [78, '西市街道'],
    [41, '茅家岭街道'],
    [127, '灵溪街道'],
    [20, '东市街道'],
    [79, '北门街道'],
    [91, '沙溪镇'],
    [10, '朝阳镇'],
    [201, '秦峰乡']
]

// 求职岗位热度
let dataJobWantedHot = [
    [59, '水南街道'],
    [78, '西市街道'],
    [41, '茅家岭街道'],
    [127, '灵溪街道'],
    [20, '东市街道'],
    [79, '北门街道'],
    [91, '沙溪镇'],
    [10, '朝阳镇'],
    [201, '秦峰乡']
]

// 招聘职位热度
let dataJobHot = [
    [59, '水南街道'],
    [78, '西市街道'],
    [41, '茅家岭街道'],
    [127, '灵溪街道'],
    [20, '东市街道'],
    [79, '北门街道'],
    [91, '沙溪镇'],
    [10, '朝阳镇'],
    [201, '秦峰乡']
]

// 人员区域分布右边的饼图
let dataPie = [
    { value: 40, name: '20%' },
    { value: 38, name: '10%' },
    { value: 32, name: '15%' },
    { value: 30, name: '20%' },
    { value: 28, name: '25%' },
]

// 滚动的泡泡
let dataPop = [
    { name: "教育" },
    { name: "水利" },
    { name: "卫生" },
    { name: "教育" },
    { name: "行政" },
    { name: "交通" },
]

/**
 * 年龄、性别、学历比例分布
 */
// 年龄、学历
let dataAge = [
    { value: 4, name: '20-29岁' },
    { value: 2, name: '30-39岁' },
    { value: 2, name: '40-49岁' },
    { value: 1, name: '50岁以上' },
]
let dataEducation = [
    { value: 4, name: '20-29岁' },
    { value: 2, name: '30-39岁' },
    { value: 2, name: '40-49岁' },
    { value: 1, name: '50岁以上' },
]
// 性别人数
let dataGender = {
    female: 41922,
    male: 18510,
    total: 60432
}

// 求职意愿、企业用工数走势图
let dataJobWanted = [
    {
        datetime: ['17', '18', '19', '20', '21', '22', '23'],
        job: [12, 211, 21, 21, 31, 23],
        company: [12, 211, 21, 21, 31, 23]
    }
]

// 地图数据
let dataMap = {
    data:[],
    geoCoordMap:{},
}